/*
	1. Напишіть програму, яка зчитує ім'я файлу як аргумент командного рядка і відкриває файл для читання.
	Розробіть алгоритм аналізу всіх символів,
	що зберігаються у файлі,
	і виведіть на екран лише текстові символи та розділові знаки (пропускайте всі недруковані символи).
	Перед завершенням програми закрийте файл.
*/


#include <iostream>
#include <fstream>
#include <cctype>

int main() {
    char fileName[80];
    std::cout << "File name: ";
    std::cin>>fileName;
    std::ifstream fin(fileName); // Відкриваємо файл для читання
    if (!fin.is_open()) {
        std::cerr << "Failed to open file text.txt\n";
        exit(1);//повертаємо 1 якщо немає файлу
    }

    char read[100];
    while (fin.getline(read, 100)) { // Читаємо рядок з файлу
        for (int i = 0; read[i] != '\0'; ++i) { // Перебираємо кожен символ у рядку
            if (std::isprint(read[i])) { // Перевіряємо, чи є символ друкованим
                std::cout << read[i]; // Виводимо символ на екран, якщо він друкований
            }
        }
    }

    fin.close(); // Закриваємо файл
    return 0;
}


